blog/data-erasure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>数据如何安全擦除</title>
<!-- 2020-12-15 Tue 23:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">数据如何安全擦除</h1>
<p>
<b><b>This project records the secure erasure of all data in the Linux system.</b></b>
</p>

<p>
OS:Centos
If you use other Linux distributions, please obtain the following programs through the corresponding package manager.
</p>


<p>
plan 1: Secure-Delete
</p>

<p>
```
sudo yum install secure-delete
```
</p>

<p>
then, you can use the `srm` command to delete files.
The `srm` command works similarly to the `rm` command, but it is more than just deleting a file. It first rewrites the file several times with some random data, and then deletes the file completely.
</p>

<p>
```
sudo srm  /datas/*
```
</p>

<p>
`sfill` detects the space marked as free or available in the specified partition or directory, and then uses its own algorithm to fill it with some random data. Therefore, it ensures that there are no files or folders that can be recovered on this partition.
</p>

<p>
```
sudo sfill /home
```
</p>

<p>
The `sswap` command is used to safely clear your swap partition. The swap partition is used to store data for running programs.
</p>

<p>
```
sudo sswap /dev/sda5
```
</p>

<p>
`Smem` is used to clean up the content in the memory. Although the content in the random access memory (RAM) will be cleaned up when the system is restarted or shut down, some residual traces of data will still remain in the memory. This command provides safe memory cleaning, just run the `smem` command in the terminal.
</p>


<p>
plan2: shred
</p>

<p>
Use the shred tool to run the following command to delete the file:
```
shred /home/test.jpg
```
</p>

<p>
plan3: dd (recommend)
</p>

<p>
```
dd if=/dev/zero of=/dev/sda bs=2MB oflag=nonblock
```
</p>

<p>
plan4: wipe(slow)
</p>

<p>
```
sudo yum install wipe
```
</p>

<p>
Delete Files:
```
wipe filename
```
</p>

<p>
Delete the contents of the complete partition:
```
wipe /dev/sda1
```
</p>


<p>
source: <a href="https://github.com/ixiniansec/Data-erasure">https://github.com/ixiniansec/Data-erasure</a>
</p>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>